phil971-psr.org
#+title: PHIL 971 - The Principle of Sufficient Reason 
#+date: July 8, 2022
#+author: Colin McLear

*** DONE Week 8 – Kant III: The Temporal PSR
    SCHEDULED: <2022-10-13 Thu>
   :PROPERTIES:
   :EXPORT_HUGO_TAGS: causation intelligibility kant psr succession time  
   :EXPORT_FILE_NAME: week8
   :END:        

Thus far we've looked at Kant's pre-critical view of ground, the PSR, and its
legitimate scope. This week we'll discuss Kant's critical view regarding
temporal succession and causal determination and examine the sense in which this
counts as endorsing a version of the PSR.

- [[https://discord.com/channels/1006739669842673674/1027749271254085752][Discussion thread]]
- [[id:20221012T220355.850099][Notes]] ([[file:static/materials/handouts/kant-temporal-psr.pdf][PDF]])
- [[file:static/materials/handouts/week-8-handout.pdf][Handout]]

**** Readings
- Kant: [[https://www.icloud.com/iclouddrive/0ac8OtNhxd8ZmxLvrUcvNfl1g#kant1998i][The Analogies of Experience]] (focus on the 2nd)
      
**** Recommended
- Kant: [[https://www.icloud.com/iclouddrive/02eJtNTbA8OezcnALsaUuQ7cw#kant1998-antinomies][The Antinomies of Pure Reason]] 
- Longuenesse: "[[https://www.icloud.com/iclouddrive/0521hyCyvOgphyLl2BcfiseXw#longuenesse2001][Kant’s Deconstruction of the Principle of Sufficient Reason]]"
- Watkins: [[file:static/materials/readings/watkins-causality.pdf][/Kant and the Metaphysics of Causality/]], chs. 3-4
- Watkins: "[[https://www.icloud.com/iclouddrive/05fa-9UGF_yUZv-vEXxfThzfQ#watkins2010b][The Antinomy of Practical Reason]]"
  
