content/assignments/week8.md
+++
title = "Week 8 – Kant III: The Temporal PSR"
publishDate = 2022-10-13T00:00:00-05:00
tags = ["causation", "intelligibility", "kant", "psr", "succession", "time"]
draft = false
weight = -100
author = false
toc = false
type = "post"
+++

Thus far we&rsquo;ve looked at Kant&rsquo;s pre-critical view of ground, the PSR, and its
legitimate scope. This week we&rsquo;ll discuss Kant&rsquo;s critical view regarding
temporal succession and causal determination and examine the sense in which this
counts as endorsing a version of the PSR.

-   [Discussion thread](https://discord.com/channels/1006739669842673674/1027749271254085752)
-   [Notes]({{< relref "kant-temporal-psr" >}}) ([PDF](/materials/handouts/kant-temporal-psr.pdf))


## Readings {#readings}

-   Kant: [The Analogies of Experience](https://www.icloud.com/iclouddrive/0ac8OtNhxd8ZmxLvrUcvNfl1g#kant1998i) (focus on the 2nd)


## Recommended {#recommended}

-   Kant: [The Antinomies of Pure Reason](https://www.icloud.com/iclouddrive/02eJtNTbA8OezcnALsaUuQ7cw#kant1998-antinomies)
-   Longuenesse: &ldquo;[Kant’s Deconstruction of the Principle of Sufficient Reason](https://www.icloud.com/iclouddrive/0521hyCyvOgphyLl2BcfiseXw#longuenesse2001)&rdquo;
-   Watkins: [_Kant and the Metaphysics of Causality_](/materials/readings/watkins-causality.pdf), chs. 3-4
-   Watkins: &ldquo;[The Antinomy of Practical Reason](https://www.icloud.com/iclouddrive/05fa-9UGF_yUZv-vEXxfThzfQ#watkins2010b)&rdquo;
